water-hammer/case-1d-3d/fluid3d-left/system/probes
#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U);
probeLocations
(
    (0 0 0)
    (0 500 0)
);

// ************************************************************************* //
